; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 521815 2 3 2 5 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	spectrograph1 - mode
	thermograph0 - mode
	Star3 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Planet7 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 spectrograph1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument2 spectrograph1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 spectrograph1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
)
(:goal (and
	(pointing satellite1 GroundStation0)
	(have_image Phenomenon5 spectrograph1)
	(have_image Phenomenon6 spectrograph1)
	(have_image Planet7 thermograph0)
))

)

; plan
1. (turn_to satellite1 groundstation0 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 groundstation0)
   goals met: 1 of 4
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 4
3. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 4
4. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 1 of 4
5. (calibrate satellite1 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 1 of 4
6. (turn_to satellite0 planet7 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 planet7)
   goals met: 1 of 4
7. (turn_to satellite1 phenomenon6 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon6)
   goals met: 0 of 4
8. (take_image satellite0 planet7 instrument0 thermograph0)
   added: (have_image planet7 thermograph0)
   goals met: 1 of 4
9. (take_image satellite1 phenomenon6 instrument2 spectrograph1)
   added: (have_image phenomenon6 spectrograph1)
   goals met: 2 of 4
10. (turn_to satellite1 groundstation0 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 groundstation0)
   goals met: 3 of 4
11. (turn_to satellite0 phenomenon5 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 phenomenon5)
   goals met: 3 of 4
12. (take_image satellite0 phenomenon5 instrument0 spectrograph1)
   added: (have_image phenomenon5 spectrograph1)
   goals met: 4 of 4
